Revit 2025 API
Categories.Item(BuiltInCategory) Property
 Retrieves a category object corresponding to a BuiltInCategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public virtual Category this[
	BuiltInCategory categoryId
] { get; }
Public Overridable ReadOnly Property Item (
	categoryId As BuiltInCategory
) As Category
	Get
public:
virtual property Category^ Item[BuiltInCategory categoryId] {
	Category^ get (BuiltInCategory categoryId);
}
abstract Item : Category with get
override Item : Category with get
Parameters
categoryId BuiltInCategory
Property Value
Category
Remarks
 Unlike the method that obtains categories by name, this routine will obtain the handle even of built-in subcategories. Since 2016 it is advised to use either [!:​Autodesk::​Revit::DB::​Category::​GetCategory(​Document,​BuiltIn​Category)] or [!:​Autodesk::​Revit::DB::​Category::​GetCategory(​Document,​ElementId)]​ method from Category class.
See Also
Reference
Categories Class
Item Overload
Autodesk.Revit.DB Namespace